In [1]:
#!pip install pandas

import sqlite3
import pandas as pd
from sqlalchemy import create_engine, text
import os

In [3]:
conn = sqlite3.connect(r"C:\Users\dhanu\OneDrive\Desktop\Repo\VR_Training\module_2\database\VR.db")

In [16]:
cursor =  conn.cursor()

In [10]:
cursor.execute("SELECT * FROM employees")

In [11]:
for i in cursor.fetchall():
    print(i)

(1, 'John', 'Smith', 'john.smith@company.com', '2020-01-15', 95000, 1, None)
(2, 'Sarah', 'Johnson', 'sarah.johnson@company.com', '2019-03-22', 87000, 1, 1)
(3, 'Mike', 'Brown', 'mike.brown@company.com', '2021-06-10', 72000, 1, 1)
(4, 'Emily', 'Davis', 'emily.davis@company.com', '2020-09-05', 68000, 2, None)
(5, 'David', 'Wilson', 'david.wilson@company.com', '2018-11-30', 78000, 2, 4)
(6, 'Lisa', 'Anderson', 'lisa.anderson@company.com', '2022-02-14', 85000, 3, None)
(7, 'Tom', 'Taylor', 'tom.taylor@company.com', '2021-08-20', 65000, 3, 6)
(8, 'Anna', 'Martinez', 'anna.martinez@company.com', '2020-04-12', 62000, 4, None)
(9, 'Chris', 'Garcia', 'chris.garcia@company.com', '2019-07-08', 89000, 5, None)
(10, 'Jessica', 'Lee', 'jessica.lee@company.com', '2021-12-03', 71000, 1, 1)

In [12]:
cursor.fetchall()

[]

In [13]:
cursor.close()

In [19]:
cursor.execute("SELECT * from employees where salary > 70000")

In [20]:
for i in cursor.fetchall():
    print(i)

(1, 'John', 'Smith', 'john.smith@company.com', '2020-01-15', 95000, 1, None)
(2, 'Sarah', 'Johnson', 'sarah.johnson@company.com', '2019-03-22', 87000, 1, 1)
(3, 'Mike', 'Brown', 'mike.brown@company.com', '2021-06-10', 72000, 1, 1)
(5, 'David', 'Wilson', 'david.wilson@company.com', '2018-11-30', 78000, 2, 4)
(6, 'Lisa', 'Anderson', 'lisa.anderson@company.com', '2022-02-14', 85000, 3, None)
(9, 'Chris', 'Garcia', 'chris.garcia@company.com', '2019-07-08', 89000, 5, None)
(10, 'Jessica', 'Lee', 'jessica.lee@company.com', '2021-12-03', 71000, 1, 1)

In [23]:
import pandas as pd

sql_statement = "SELECT * from employees where salary > 70000"

In [25]:
df = pd.read_sql(sql=sql_statement,con=conn)

In [ ]:
SELECT * FROM employees WHERE first_name LIKE 'J%';

SELECT first_name as Fname FROM employees WHERE first_name='John';

select Fname from (Select first_name as fname from  employees) where fname='John';

In [29]:
df.loc[df['first_name'].str.startswith("J")]

,employee_id,first_name,last_name,email,hire_date,salary,department_id,manager_id
0,1,John,Smith,john.smith@company.com,2020-01-15,95000,1,NaN
6,10,Jessica,Lee,jessica.lee@company.com,2021-12-03,71000,1,1.0

SELECT first_name from employees;

In [34]:
df.loc[df['first_name']=='John']

,employee_id,first_name,last_name,email,hire_date,salary,department_id,manager_id
0,1,John,Smith,john.smith@company.com,2020-01-15,95000,1,NaN